de_alliantie/webservices/movinu/UpdateWosIntake.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:won="http://www.daan.com/ax/woningnet/">
   <soapenv:Header/>
   <soapenv:Body>
      <won:DeclareEmpty>
         <Publication>
            <Id>?</Id>
            <Number>?</Number>
            <Sequence>?</Sequence>
            <RealEstateObjectId>?</RealEstateObjectId>
            <AddressStreet>?</AddressStreet>
            <AddressHouseNumber>?</AddressHouseNumber>
            <AddressHouseNumberAddition>?</AddressHouseNumberAddition>
            <AddressZipcode>?</AddressZipcode>
            <AddressCity>?</AddressCity>
            <DistrictId>?</DistrictId>
            <District>?</District>
            <NeighborhoodId>?</NeighborhoodId>
            <Neighborhood>?</Neighborhood>
            <RegistrationTypeId>?</RegistrationTypeId>
            <RegistrationType>?</RegistrationType>
            <HousingId>?</HousingId>
            <Housing>?</Housing>
            <PlotTypeId>?</PlotTypeId>
            <PlotType>?</PlotType>
            <NetRent>?</NetRent>
            <EligibleRent>?</EligibleRent>
            <GrossRent>?</GrossRent>
            <DateEmpty>?</DateEmpty>
            <DateAvailable>?</DateAvailable>
            <Start>?</Start>
            <End>?</End>
            <FloorNo>?</FloorNo>
            <BuiltYear>?</BuiltYear>
            <SellingPrice>?</SellingPrice>
            <PractitionerId>?</PractitionerId>
            <Practitioner>?</Practitioner>
            <PublicationText>?</PublicationText>
            <ObjectGroupId>?</ObjectGroupId>
            <ObjectGroup>?</ObjectGroup>
            <SortField1Id>?</SortField1Id>
            <SortField1>?</SortField1>
            <SortField2Id>?</SortField2Id>
            <SortField2>?</SortField2>
            <SortField3Id>?</SortField3Id>
            <SortField3>?</SortField3>
            <DestinationId>?</DestinationId>
            <Destination>?</Destination>
            <Corporatienummer>?</Corporatienummer>
            <Vestigingsnummer>?</Vestigingsnummer>
         </Publication>
         <Components>
            <!--1 or more repetitions:-->
            <Component>
               <Id>?</Id>
               <Description>?</Description>
               <Value>?</Value>
            </Component>
         </Components>
         <ContractForms>
            <!--1 or more repetitions:-->
            <ContractForm>
               <Id>?</Id>
               <Description>?</Description>
            </ContractForm>
         </ContractForms>
         <Attributes>
            <!--1 or more repetitions:-->
            <Attribute>
               <Id>?</Id>
               <Name>?</Name>
               <Value>?</Value>
            </Attribute>
         </Attributes>
         <Criterion>
            <!--1 or more repetitions:-->
            <Criteria>
               <Criteriumgroup>?</Criteriumgroup>
               <Criteriatype>?</Criteriatype>
               <Filtergroups>
                  <!--1 or more repetitions:-->
                  <Filtergroup>
                     <Id>?</Id>
                     <Description>?</Description>
                     <Type>?</Type>
                  </Filtergroup>
               </Filtergroups>
               <Rules>
                  <Rule>
                     <Description>?</Description>
                     <MatchingAttribute>?</MatchingAttribute>
                     <MatchingRule>?</MatchingRule>
                     <Sequence>?</Sequence>
                     <ValueStart>?</ValueStart>
                     <ValueEnd>?</ValueEnd>
                     <ValueType>?</ValueType>
                  </Rule>
               </Rules>
            </Criteria>
         </Criterion>
         <Pictures>
            <!--1 or more repetitions:-->
            <Picture>
               <File>?</File>
            </Picture>
         </Pictures>
      </won:DeclareEmpty>
   </soapenv:Body>
</soapenv:Envelope>